owledge/app/models/note.rb

  def self.allParents
    return self.where('parent_id is null')
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def self.ancestors(parent_id = nil)
    if parent_id == nil? or parent_id.blank?
      return [self]
    end
    parent = self.find(parent_id)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def parent
    if self.parent_id?
      Note.find(self.parent_id)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def likes()
    UserReaction.where(note_id: self.id).count
---
SELECT COUNT(*) FROM "user_reactions" WHERE "user_reactions"."note_id" = ?  [["note_id", 2]]