owledge/app/models/user.rb

SELECT "user_reactions".* FROM "user_reactions" WHERE "user_reactions"."user_id" = ? AND "user_reactions"."note_id" = ? ORDER BY "user_reactions"."id" ASC LIMIT ?  [["user_id", 3], ["note_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_reactions" WHERE "user_reactions"."user_id" = ? AND "user_reactions"."note_id" = ? LIMIT ?  [["user_id", 3], ["note_id", 1], ["LIMIT", 1]]
SELECT "user_reactions".* FROM "user_reactions" WHERE "user_reactions"."user_id" = ? AND "user_reactions"."note_id" = ?  [["user_id", 3], ["note_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def is_like_clicked(note_id)
    reaction = UserReaction.where(user_id: self.id, note_id: note_id).first
    if reaction.nil? or reaction.empty?

SELECT "user_reactions".* FROM "user_reactions" WHERE "user_reactions"."user_id" = ? AND "user_reactions"."note_id" = ? ORDER BY "user_reactions"."id" ASC LIMIT ?  [["user_id", 3], ["note_id", 1], ["LIMIT", 1]]
---
  def likes_click(note_id)
    reaction = UserReaction.where(user_id: self.id, note_id: note_id).first