owledge/app/controllers/notebooks_controller.rb

INSERT INTO "notes" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "AI"], ["description", "Artificial Intelligence"], ["created_at", "2021-03-16 02:56:05.904084"], ["updated_at", "2021-03-16 02:56:05.904084"]]
---
  def create
    @note = Note.new(allowed_params)
    @ancestors = @note.ancestors
    if @note.valid?
      if @note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    flash[:error] = nil
    id = params[:id]
    begin
      @note = Note.find(id)

SELECT "notes".* FROM "notes" WHERE (title LIKE '%Selection Sort%')
---
  def index
    @ancestors = []
    searchContent = params[:search_by_contain]
    logger.debug(searchContent)
    if searchContent.nil? || searchContent.empty?
      @notes = Note.allParents
    else
      @notes = Note.search(searchContent)