owledge/app/controllers/users_controller.rb

  def show
    if current_user.nil? and !params.key?(:id)
      redirect_to 'index' and return
    elsif id.nil?
      @user = current_user
      return
    end
    id = params[:id]

    flash[:error] = nil
    begin
      @user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]