owledge/app/views/parts/_reaction.erb

SELECT COUNT(*) FROM "user_reactions" WHERE "user_reactions"."note_id" = ?  [["note_id", 1]]
---
like
<h1>"<%=@note.user_reactions.count %>"</h1>