owledge/app/views/notebooks/show.html.erb

SELECT "user_comments".* FROM "user_comments" WHERE "user_comments"."note_id" = ?  [["note_id", 1]]
---
        <ul class="list-group">
          <% @note.user_comments.each do |user_comment| %>

SELECT "user_reactions".* FROM "user_reactions" WHERE "user_reactions"."user_id" = ? AND "user_reactions"."note_id" = ? ORDER BY "user_reactions"."id" ASC LIMIT ?  [["user_id", 3], ["note_id", 1], ["LIMIT", 1]]
---
      <!--ul class="list-group">
         @note.user_reactions.each do |user_reaction| %>